name: "master_router"
backend: "python"
max_batch_size: 0

input [
  {
    name: "IMAGE"
    data_type: TYPE_UINT8
    dims: [ -1, -1, -1, 3 ]
  }
]

output [
  {
    name: "JSON_RESULT"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "VISUALIZED_IMAGE"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]
