name: "shared_yolo_detector"
backend: "python"
max_batch_size: 0

input [
  {
    name: "IMAGE"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]

output [
  {
    name: "DETECTION_BOXES"
    data_type: TYPE_FP32
    dims: [ -1, 4 ]
  },
  {
    name: "DETECTION_CLASSES"
    data_type: TYPE_INT32
    dims: [ -1 ]
  },
  {
    name: "DETECTION_SCORES"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]
