name: "swin2sr"
platform: "onnxruntime_onnx"
max_batch_size: 8

input [
  {
    name: "pixel_values"
    data_type: TYPE_FP32
    dims: [ 3, -1, -1 ]
  }
]
output [
  {
    name: "reconstruction"
    data_type: TYPE_FP32
    dims: [ 3, -1, -1 ]
  }
]
instance_group [ { count: 2, kind: KIND_GPU } ]
