name: "doctr_ocr"
backend: "python"
max_batch_size: 16

input [
  {
    name: "IMAGE"
    data_type: TYPE_UINT8
    dims: [ 32, 128, 3 ]
  }
]

output [
  {
    name: "TEXT_RESULT"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "CONFIDENCE"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
    gpus: [0]
  }
]
