name: "shared_doctr_ocr_plan"
platform: "tensorrt_plan"
max_batch_size: 0

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ 1, 3, 32, 128 ]
  }
]

output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [ 1, 33, 51 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]
