name: "shared_swin2sr_optimizer"
backend: "python"
max_batch_size: 16

input [
  {
    name: "IMAGE"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]

output [
  {
    name: "IMAGE_SR"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]
