name: "doctr_rec"
platform: "onnxruntime_onnx"
max_batch_size: 8

input [
  {
    name: "x"
    data_type: TYPE_FP32
    dims: [ 3, 32, 128 ]
  }
]
output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [ -1, 119 ]
  }
]
instance_group [ { count: 4, kind: KIND_GPU } ]
